In [1]:
%load_ext sql

In [12]:
%sql sqlite:book.db

 * sqlite:///book.db
(sqlite3.OperationalError) near "sqlite": syntax error
[SQL: sqlite:book.db]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [27]:
%%sql
result << SELECT * FROM topnames
ORDER BY year DESC, sex ASC
LIMIT 4

 * sqlite:///book.db
Done.
Returning data to local variable result

In [28]:
import pandas as pd
pd.DataFrame(result)

      0       1     2      3
0  2018  Female  Emma  18688
1  2018    Male  Liam  19837
2  2017  Female  Emma  19800
3  2017    Male  Liam  18798